Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: If neither $ANTIALIASED_QUALITY nor $NONANTIALIASED_QUALITY is selected, the font is antialiased only if the user chooses smooth screen fonts in Control Panel.
fr: Si ni $ANTIALIASED_QUALITY ni $NONANTIALIASED_QUALITY n'est sélectionné, la police est anti-crénelée seulement si l'utilisateur choisit les polices d'écran lisses dans le Panneau de configuration.

source: By default, controls use the font set by GUISetFont().
fr: Par défaut, les contrôles utilisent la police définit par GUISetFont().

source: See the Appendix for a complete list of Windows fonts and the Windows versions under which they are supported.
fr: Consultez l'Appendice pour une liste complète des polices Windows et les versions de Windows dans lesquelles elles sont prises en charge.

source: Size can contain a decimal as in 8.5.
fr: La taille peut contenir un nombre décimal comme 8.5.

source: For some controls such as labels, the default size can be 8.5 instead of 9 according to Windows Theme Values.
fr: Pour certains contrôles tels que les Label, la taille par défaut peut être de 8,5 au lieu de 9 en accord avec les valeurs du thème de Windows.

source: For Quality parameter check MSDN, some Windows XP installation need CLEARTYPE_QUALITY=5
fr: Pour le paramètre Quality consultez MSDN, certaines installations de Windows XP nécessite CLEARTYPE_QUALITY = 5

source: Font type to be used for setting the font of the controls.
fr: Type de police à utiliser pour les contrôles.

source: Create label controls.
fr: Crée des contrôles Label.

source: Set the font of the previous control.
fr: Définit la police du contrôle précédent.

source: Set the font of the controlID stored in $iLabel2.
fr: Définit la police de la controlID stocké dans $iLabel2.

source: Set the font of the controlID stored in $iLabel3.
fr: Définit la police de la controlID stocké dans $iLabel3.

source: The control identifier (controlID) as returned by a GUICtrlCreateGraphic() function.
fr: L'identifiant du contrôle (controlID) tel que renvoyé par une fonction GUICtrlCreateGraphic().

source: type of drawing : dot, line, bezier, rect, ellipse, pie.
fr: Type de dessin : point, ligne, Bézier, rectangle, ellipse, arc de cercle.

source: See the Graphic Type table below.
fr: Voir la Table des types graphiques ci-dessous.

source: The point position (x,y) is relative to the GUICtrlCreateGraphic() coordinates.
fr: La position du point (x, y) est relative aux coordonnées GUICtrlCreateGraphic().

source: It can be outside the graphic control but inside of the GUI window.
fr: Il peut être en dehors du contrôle graphique mais à l'intérieur de la fenêtre GUI.

source: Define the color of the next drawings.
fr: Définit la couleur des prochains dessins.

source: When BkColor is equal to $GUI_GR_NOBKCOLOR the drawing will not be filled.
fr: Lorsque BkColor est égale à $GUI_GR_NOBKCOLOR le dessin ne sera pas remplie.

source: It is the default.
fr: C'est la valeur par défaut.

source: For Color the default line color is black.
fr: Pour Color la couleur de ligne par défaut est noir.

source: Move the current position without drawing.
fr: Déplace la position courante sans dessiner.

source: Draw a point(smallest square around the point), the next drawing will start from previous position.
fr: Dessine un point (petit carré autour du point), le prochain dessin démarrera de la position précédente.

source: Draw a pixel, the next drawing will start from previous position.
fr: Dessine un pixel, le prochain dessin démarrera de la position précédente.

source: Draw a line.
fr: Trace une ligne.

source: Draw a bezier curve with 2 control points.
fr: Dessine une courbe de Bézier avec 2 points de contrôle.

source: Draw a rectangle.
fr: Trace un rectangle.

source: If w=h it will be a square.
fr: Si w = h, ce sera un carré.

source: Draw an ellipse.
fr: Dessine une ellipse.

source: If w=h it will be a circle.
fr: Si w = h, ce sera un cercle.

source: Draw a pie radius=r startangle=sa sweepangle=wa.
fr: Dessine un arc de cercle: rayon=r startAngle=sa sweepangle=wa.

source: Angles are in degrees.
fr: Les angles sont en degrés.

source: to close the current drawing.
fr: Pour fermer le dessin courant.

source: It has to be added to $GUI_GR_LINE or $GUI_GR_BEZIER to close current drawing.
fr: Il doit être ajouté à $GUI_GR_LINE ou $GUI_GR_BEZIER pour fermer le dessin courant.

source: Use alone will be ignored.
fr: Utilisé seul, il sera ignoré.

source: to force refresh after dynamic update of graphics.
fr: Pour forcer le rafraichissemenet après une mise à jour dynamique de graphiques.

source: to display control point and end point of bezier/line curve.
fr: Pour afficher le point de contrôle et le point de fin d'une courbe de Bézier ou de ligne.

source: set pensize for the next drawings.
fr: Définit la taille du crayon pour les prochains dessins.

source: It has to be defined before $GUI_GR_COLOR to be taken in account.
fr: Elle doit être définie avant $GUI_GR_COLOR pour être prise en compte.

source: is a dummy BkColor to force closed drawing not to be filled.
fr: C'est un BkColor factice pour forcer le dessin à se fermer sans se remplir.

source: Just line drawings.
fr: Seulement des dessins de ligne.

source: Due to design constraints RECT, ELLIPSE and PIE graphics are drawn first.
fr: En raison de contraintes de conception, les graphiques RECT, ELLIPSE et PIE sont dessinés en premier.

source: For example, a LINE will always be drawn over a RECT.
fr: Par exemple, une ligne sera toujours dessinée sur un RECT.

source: If the drawing order is important to the look of the graphic, then it is recommended that multiple graphic controls be used instead of using a single control to do all the drawing.
fr: Si l'ordre de dessin est important pour l'aspect du graphique, il est recommandé d'utiliser plusieurs contrôles graphiques au lieu d'utiliser un seul contrôle pour faire tout le dessin.

source: $i=5 ; uncomment to delete starting from last define Graphic control
fr: $i = 5 ; décommenter pour supprimer le démarrage à partir du dernier contrôle graphique défini

source: to display a black border line
fr: affiche une ligne de bordure noire

source: to display control lines and end points
fr: affiche les lignes du contrôle et les points d'extrémité

source: fill in blue
fr: remplir en bleu

source: Sets the bitmap or icon image to use for a control.
fr: Définit l'image bitmap ou icône à utiliser pour un contrôle.

source: The filename containing the picture to be display on the control.
fr: Le nom du fichier contenant l'image à afficher sur le contrôle.

source: To select a specific icon size :
fr: Pour sélectionner la taille d'une icône spécifique :

source: 0 = small, 1 = normal (default).
fr: 0 = petite, 1 = normale (par défaut).

source: For a TreeViewItem the icon size :
fr: Pour un TreeViewItem la taille de l'icône :

source: 2 = selected, 4 for non-selected item.
fr: 2 = sélectionné, 4 pour un item non sélectionné.

source: Use a resource hacker to know the value of the valid icon name in a file.
fr: Utilisez un hacker de ressources pour connaître la valeur du nom de l'icône valide dans un fichier.

source: If used on a Button control the image will be displayed on the button.
fr: Si elle est utilisée sur un contrôle Button, l'image sera affichée sur le bouton.

source: Images can also be set for Checkbox controls as long as the $BS_PUSHLIKE style is used.
fr: Les images peuvent également être définies pour des contrôles Checkbox aussi longtemps que le style $BS_PUSHLIKE est utilisé.

source: In both case the $BS_ICON or $BS_BITMAP styles are needed to select the type of the picture used.
fr: Dans les deux cas, les styles $BS_ICON ou $BS_BITMAP sont nécessaires pour sélectionner le type de l'image utilisée.

source: The first icon resolution will be used in a multi icon resolution file.
fr: La première résolution de l'icône sera utilisée dans un fichier multi icône de résolution.

source: I.E. if a 128x128 is the first resolution and the control is 64x64 the image will be truncated.
fr: I.E.si 128x128 est la première résolution et le contrôle est 64x64 l'image sera tronquée.

source: If you use this command on a TreeViewItem the first time, then all other items will use this icon/image automatically by default !!!
fr: Si vous utilisez ce contrôle sur un TreeViewItem la première fois, alors tous les autres items vont utiliser cette icône/image automatiquement par défaut!!!

source: If you use GUICtrlSetImage() on a TreeView or ListView then all items of it will change to this icon/image.
fr: Si vous utilisez GUICtrlSetImage() sur un TreeView ou une ListView, tous les items de celui-ci vont adopter cette icône/image.

source: Limits the number of characters/pixels for a control.
fr: Limite le nombre de caractères/pixels pour un contrôle.

source: For List controls it is the extent you can scroll horizontally in pixels.
fr: Pour les contrôles List, max est la limite en pixels du défilement horizontalement.

source: For Input/Edit controls it is the max number of characters that can be entered.
fr: Pour les contrôles Input/Edit, max est le nombre maximum de caractères qui peuvent être entrés.

source: For Slider and UpDown controls you can specify a min value.
fr: Pour les contrôles Slider et UpDown, vous pouvez spécifier une valeur minimale.

source: Default = 0
fr: Par défaut = 0

source: to limit the entry to 3 chars
fr: limite l'entrée à 3 caractères

source: Defines a user-defined function to be called when a control is clicked.
fr: Définit une fonction utilisateur appelée quand un contrôle est cliqué.

source: The name of the user function to call.
fr: Le nom de la fonction utilisateur à appeler.

source: OnEvent functions are only called when the option GUIOnEventMode is set to 1 - when in this mode GUIGetMsg() is NOT used at all.
fr: Les fonctions OnEvent ne sont appelées que si l'option GUIOnEventMode est installée à 1 - dans ce mode GUIGetMsg() n'est pas utilisé du tout.

source: You can not call a function using parameters.
fr: Vous ne pouvez pas appeler une fonction qui a des paramètres.

source: Within the called user function the control identifier can be retrieved with @GUI_CtrlId.
fr: Dans la fonction utilisateur appelée l'identifiant deu contrôle peut être récupéré avec @GUI_CtrlId.

source: If needed the windows handle and the control handle can be retrieved with @GUI_WinHandle or @GUI_CtrlHandle.
fr: Si nécessaire le handle de la fenêtre et le handle du contrôle peuvent être récupérés avec @GUI_WinHandle ou @GUI_CtrlHandle.

source: If the function is an empty string "" the previous user-defined is disabled.
fr: Si la fonction est une chaîne vide "" la précédente fonction définie par l'utilisateur est désactivée.

source: Just idle around
fr: Boucle sans fin

source: Changes the position of a control within the GUI window.
fr: Modifie la position d'un contrôle dans la fenêtre GUI.

source: The width of the control.
fr: La largeur du contrôle.

source: The height of the control .
fr: La hauteur du contrôle.

source: If the Default keyword is used as a parameter, the current value is not modified.
fr: Si le mot-clé Default est utilisé en tant que paramètre, la valeur courante n'est pas modifiée.

source: Defines the resizing method used by a control.
fr: Définit la méthode de redimensionnement utilisée par un contrôle.

source: See the Docking Values table below for values that can be used (add together multiple values if required).
fr: Voir la Tableau des valeurs d'Ancrage ci-dessous pour les valeurs qui peuvent être utilisées (additionner plusieurs valeurs si nécessaire).

source: When a GUI window is resized the controls within react - how they react is determined by this function.
fr: Quand une fenêtre GUI est redimensionnée, ses contrôles réagissent - la façon dont ils réagissent est déterminée par cette fonction.

source: To be able to resize a GUI window it needs to have been created with the $WS_SIZEBOX and $WS_SYSMENU styles.
fr: Pour être en mesure de redimensionner une fenêtre GUI, elle doit avoir été créée avec les styles $WS_SIZEBOX et $WS_SYSMENU.

source: See GUICreate().
fr: Consultez GUICreate().

source: Docking Values Table
fr: Tableau des valeurs d'Ancrage

source: Resizing
fr: Redimensionnement

source: No displacement of
fr: Effet

source: resize and reposition according to new window size
fr: Redimensionne et repositionne en accord avec la nouvelle taille de la fenêtre

source: Left side
fr: Conserve la distance au coté gauche de la GUI (Left)

source: Right side
fr: Conserve la distance au coté droit de la GUI

source: Position will not move relative to horizontal center
fr: Conserve la distance à l'axe central horizontal de la GUI

source: Top side
fr: Conserve la distance au coté haut de la GUI (Top)

source: Bottom side
fr: Conserve la distance au coté bas de la GUI

source: Position will not move relative to vertical center
fr: Conserve la distance à l'axe central vertical de la GUI

source: Width will not change
fr: Conserve la largeur du contrôle (Width)

source: Height will not change
fr: Conserve la hauteur du contrôle (Height)

source: Composite resizing
fr: Redimensionnement composé

source: (256+512) Size will not change
fr: ( 256 + 512 ) Conserve la taille du contrôle (Width/Height)

source: (512+32) so the control will stay at the top of window with no change in Height
fr: ( 512 + 32 ) Conserve la distance au coté haut de la GUI (Top), et la hauteur du contrôle (Height)

source: (512+64) so the control stay at the bottom of the window with no change in Height
fr: ( 512 + 64 ) Conserve la distance au coté bas de la GUI, et la hauteur du contrôle (Height)

source: (2+32+256+512) so the control will not move during resizing
fr: ( 2 + 32 + 256 + 512 ) Conserve la position du contrôle (Left/Top) et sa taille (Width/Height)

source: (2+4+32+64) so the control will grow as the window
fr: ( 2 + 4 + 32 + 64 ) Conserve les distances aux quatre cotés de la GUI de sorte que le contrôle se développera comme la GUI

source: The default resizing for a given control is control dependent see the control doc.
fr: La valeur par défaut de redimensionnement pour un contrôle donné est $GUI_DOCKAUTO, voir la documentation sur les contrôles.

source: A default value for any control can be set with GUIResizeMode (Option).
fr: Une valeur par défaut pour tous les contrôles peut être définie avec GUIResizeMode (Option).

source: The automatic resizing event can be disabled if GUIEventOptions (Option) is set to 1.
fr: L'événement de redimensionnement automatique peut être désactivée si GUIEventOptions (Option) est mis à 1.

source: start the definition
fr: commence la définition

source: add prompt info
fr: ajoute des informations rapides

source: add the input area
fr: ajoute une zone de saisie

source: add the button that will close the GUI
fr: ajoute un bouton qui fermera la GUI

source: to display the GUI
fr: pour afficher l'interface graphique

source: Changes the state of a control.
fr: Modifie l'état d'un contrôle.

source: See the State table below.
fr: Consultez le Tableau des Etats ci-dessous.

source: State table
fr: Tableau des Etats

source: State
fr: Etats

source: Comments
fr: Commentaires

source: Radio, Checkbox or ListViewItem will be checked.
fr: Les contrôles Radio, Checkbox ou ListViewItem seront cochés.

source: Checkbox having the tristate attribute will be greyed.
fr: Les contrôles Checkbox qui ont l'attribut à trois états seront grisés.

source: Radio, Checkbox or ListViewItem will be unchecked.
fr: Les contrôles Radio, Checkbox ou ListViewItem seront décochés.

source: Control will accept drop action : from file or from a drag of another control.
fr: Le contrôle acceptera action Drop : à partir d'un fichier ou d'un Drag d'un autre contrôle.

source: Control will be visible.
fr: Le contrôle sera visible.

source: On Tabitem control will select the first tab to be displayed.
fr: Le TabItem sélectionnera le premier onglet à afficher.

source: Control will not be visible.
fr: Le contrôle ne sera pas visible.

source: Control will be enabled.
fr: Le contrôle sera activé.

source: Control will be greyed out.
fr: Le contrôle sera grisé.

source: Control will be given input/selected focus.
fr: Le contrôle recevra le focus pour entrée/sélection.

source: Control will be set as the default button on the window.
fr: Le contrôle sera défini comme bouton par défaut de la fenêtre.

source: See remark about TreeviewItems.
fr: Voir Remarque sur TreeviewItems.

source: TreeViewItem will expand its child items.
fr: Le contrôle TreeViewItem développera ses items enfants.

source: Control will be have the ontop attribute for the window (zOrdering).
fr: Le contrôle aura l'attribut Ontop (au dessus des autres fenêtres) (zOrdering).

source: Control will not accept drop action.
fr: Le contrôle n'acceptera pas l'action Drop.

source: Listview control will loose focus.
fr: Le contrôle ListView perdra le focus.

source: Avi control will start playing.
fr: Le contrôle Avi démarrera la vidéo.

source: Avi control will stop playing.
fr: Le contrôle Avi arrêtera la vidéo.

source: Avi control will stop playing and release resource.
fr: Le contrôle Avi arrêtera la vidéo et libérera les ressources.

source: State values can be summed up as for example $GUI_DISABLE (128) + $GUI_HIDE (32) sets the control in an disabled and hidden state.
fr: Les valeurs d'État peuvent s'additionner comme par exemple $GUI_DISABLE(128)+$GUI_HIDE(32) définit le contrôle dans un état désactivé et caché.

source: If an AVI control has to be hidden with $GUI_HIDE (32) it should be closed with $GUI_AVICLOSE (1).
fr: Si un contrôle AVI doit être caché avec $GUI_HIDE(32), il doit être fermé avec $GUI_AVICLOSE(1).

source: State of a "contextmenu" control cannot be changed.
fr: L'état d'un contrôle "contextmenu" ne peut pas être changé.

source: State of a "listviewitem" control can be changed if the associated "listview" control has been created with an extended style $LVS_EX_CHECKBOXES.
fr: L'état d'un contrôle "ListViewItem" peut être modifié si le contrôle "listview" associé a été créé avec un style étendu $LVS_EX_CHECKBOXES.

source: $GUI_FOCUS (256) and $GUI_NOFOCUS (8192) can be used on specific listviewitem provided listview control style allows to display it :
fr: $GUI_FOCUS(256) et $GUI_NOFOCUS(8192) peuvent être utilisés sur un ListViewItem spécifique associé à un style de contrôle listview qui permet de l'afficher:

source: State of a "menu or a ""menuitem" control cannot be hidden.
fr: L'état d'un contrôle "menu" ou "menuitem" ne peut pas être Hiden (caché).

source: Important information for $GUI_EXPAND: this state is only used for TreeViewItems.
fr: Information importante pour $GUI_EXPAND: cet état n'est utilisé que pour TreeViewItems.

source: If you want to use this 'action' then at least 1 Sub-TreeViewItem has to exist/created under this item !
fr: Si vous souhaitez utiliser cette 'action' alors au moins 1 Sous-TreeViewItem doit exister ou être créé sous cet item!

source: If you want to select another item in a TreeView then you can use $GUI_FOCUS (256) - the parent TreeView gets the window focus and the specified item is marked as selected.
fr: Si vous voulez sélectionner un autre item dans un TreeView, vous pouvez utiliser $GUI_FOCUS(256) - le parent Treeview obtient le focus de la fenêtre et l'item spécifié est marqué comme sélectionné.

source: If you want to set a treeview item as a default item which means painting it bold you can use $GUI_DEFBUTTON (512) - to turn it off just use another value but $GUI_DEFBUTTON (512), for instance 0.
fr: Si vous souhaitez définir un item de Treeview comme item par défaut, ce qui signifie la mise en gras, vous pouvez utiliser $GUI_DEFBUTTON(512) - pour annuler la mise en gras il suffit d'utiliser une autre valeur que $GUI_DEFBUTTON(512), par exemple 0.

source: This state will not be returned by GUICtrlGetState().
fr: Cet état ne sera pas retourné par GUICtrlGetState().

source: If $GUI_DROPACCEPTED (8) is set to a visible control a drag & drop can be taken in account.
fr: Si $GUI_DROPACCEPTED(8) est défini sur un contrôle visible un drag & drop peut être pris en compte.

source: The edit/input control will be set with the filename.
fr: Le contrôle Edit ou Input sera défini avec le nom du fichier.

source: For other controls on reception of $GUI_EVENT_DROPPED, @GUI_DragId will return the controlID from where the drag start (-1 if from a file, @GUI_DragFile contain the filename being dropped) and @GUI_DropId returns the controlID of the dropped control.
fr: Pour d'autres contrôles à la réception de $GUI_EVENT_DROPPED, @GUI_DragId retournera le controlID d'où le drag a démarré (-1 si c'est un fichier, @GUI_DragFile contient le nom du fichier entrain de subir le 'drag') et @GUI_DropId retourne le controlID du contrôle entrain de subir le 'drop'.

source: Only dragging a ListviewItem will start the drag & drop process.
fr: C'est seulement lors du 'drag' d'un ListViewItem que démarrera le processus du drag & drop.

source: The @GUI_DragId will be the ListView controlID.
fr: @GUI_DragId sera le controlID du ListView .

source: Create a label and set the state as drop accepted.
fr: Crée un contrôle Label et définit l'état de 'drop' accepté.

source: Create an input and set the state as drop accepted.
fr: Crée un contrôle Input et définit l'état de 'drop' accepté.

source: If the value of @GUI_DropId is $idLabel, then set the label of the dragged file.
fr: Si la valeur de GUI_DropId est $idLabel, alors définit le nom du fichier déposé.

source: Changes the style of a control.
fr: Change le style d'un contrôle.

source: Defines the extended Style of the control.
fr: Définit le style étendu d'un contrôle.

source: Some styles cannot be changed dynamically, check MSDN documentation.
fr: Certains styles ne peuvent pas être modifiés dynamiquement, consultez la documentation MSDN.

source: $CBS_UPPERCASE combo style is one example.
fr: Le style $CBS_UPPERCASE d'un contrôle Combo est un exemple.

source: Sets the tip text associated with a control.
fr: Définit le texte de l'info-bulle associée à un contrôle.

source: Tip text that will be displayed when the mouse is hovered over the control.
fr: Texte de la bulle qui s'affiche lorsque la souris survole le contrôle.

source: The title for the tooltip Requires IE5+
fr: Le titre de l'info-bulle Requiert IE5+

source: Pre-defined icon to show next to the title:
fr: Icône pré-définie pour l'afficher à côté du titre:

source: Requires a title.
fr: Nécessite un titre.

source: 0 = No icon, 1 = Info icon, 2 = Warning icon, 3 = Error Icon
fr: 0 = pas d'icône, 1 = icône Info, 2 = Icône Warning, 3 = Icône Error

source: Sets different options for how the tooltip will be displayed (Can be added together):
fr: Définit différentes options pour la façon dont l'info-bulle s'affiche (Elles peuvent s'ajouter):

source: 1 = Display as Balloon Tip Requires IE5+
fr: 1 = S'affiche comme Info-bulle Balloon, Requires IE5+

source: 2 = Center the tip horizontally along the control.
fr: 2 = Centre l'Info-bulle horizontalement le long du contrôle.

source: This tip text is displayed in a tooltip rectangular area.
fr: Le texte de l'Info-bulle est affiché dans une zone rectangulaire.

source: To skip an optional parameter, leaving its default value intact, use the Default keyword..
fr: Pour sauter un paramètre optionnel, laissez sa valeur par défaut intacte, utilisez le mot-clé Default.

source: You may use @CR or @LF to create multi-line tooltips.
fr: Vous pouvez utiliser @CR ou @LF pour créer des info-bulles multi-lignes.

source: The title, icon and Balloon Tip option all require Internet Explorer 5.0 or later in order to function.
fr: Le titre, l'icône et l'option Balloon ont besoin d'Internet Explorer 5.0 ou d'une version ultérieure pour fonctionner.
